[
    {
      "skills": "JavaScript, React, Node.js",
      "workExperience": "Software Engineer at Google. Developed front-end applications using React and contributed to the design and implementation of scalable, distributed systems with Node.js. Collaborated with cross-functional teams to deliver innovative solutions.",
      "education": "Master's degree in Computer Science from Stanford University. Specialized in software engineering and machine learning.",
      "curriculumVitae": "https://example.com/resume1",
      "backgroundColor": "#15e14b",
      "textColor": "#055270",
      "fontFamily": "Helvetica",
      "profilePicture": "/images/candidates/p1.jpg",
      "coverPicture": "https://example.com/cover_picture1",
      "coverLetter": "Passionate and results-driven software engineer with a track record of success in building cutting-edge applications. Eager to contribute expertise in JavaScript, React, and Node.js to a dynamic team.",
      "jobPreferences": "Seeking a challenging role in a forward-thinking company where I can leverage my skills in front-end and back-end development to create impactful software solutions."
    },
    {
      "skills": "Python, Django, Flask",
      "workExperience": "Senior Python Developer at Microsoft. Led the development of backend systems using Django and Flask, focusing on performance optimization and scalability. Collaborated with data science teams to integrate machine learning models into production systems.",
      "education": "Ph.D. in Computer Science from MIT. Published research in the areas of distributed systems and artificial intelligence.",
      "curriculumVitae": "https://example.com/resume2",
      "backgroundColor": "#ffcc00",
      "textColor": "#333333",
      "fontFamily": "Arial",
      "profilePicture": "/images/candidates/p2.jpg",
      "coverPicture": "https://example.com/cover_picture2",
      "coverLetter": "Experienced Python developer with a focus on building scalable and efficient backend solutions. Passionate about solving complex problems and contributing to the advancement of technology.",
      "jobPreferences": "Seeking challenging opportunities in Python development where I can apply my expertise in building robust and scalable backend systems."
    },
    {
        "skills": "Java, Spring Boot, Hibernate",
        "workExperience": "Software Engineer at Amazon. Developed scalable and high-performance backend services using Java, Spring Boot, and Hibernate. Collaborated with cross-functional teams to deliver critical features for e-commerce platforms.",
        "education": "Bachelor's degree in Computer Engineering from University of California, Berkeley. Specialized in software development and database systems.",
        "curriculumVitae": "https://example.com/resume3",
        "backgroundColor": "#007acc",
        "textColor": "#ffffff",
        "fontFamily": "Verdana",
        "profilePicture": "/images/candidates/p3.jpg",
        "coverPicture": "https://example.com/cover_picture3",
        "coverLetter": "Dedicated and detail-oriented software engineer with expertise in Java, Spring Boot, and database systems. Proven track record of delivering high-quality software solutions for complex business challenges.",
        "jobPreferences": "Seeking opportunities to contribute to the development of robust and scalable backend systems using Java and related technologies."
      },
      {
        "skills": "C#, .NET Core, ASP.NET",
        "workExperience": "Senior Software Developer at Microsoft. Led the development of web applications using C#, .NET Core, and ASP.NET. Collaborated with UI/UX designers to implement responsive and user-friendly interfaces.",
        "education": "Master's degree in Computer Science from Harvard University. Specialized in software engineering and human-computer interaction.",
        "curriculumVitae": "https://example.com/resume4",
        "backgroundColor": "#f79420",
        "textColor": "#333333",
        "fontFamily": "Times New Roman",
        "profilePicture": "/images/candidates/p4.jpg",
        "coverPicture": "https://example.com/cover_picture4",
        "coverLetter": "Experienced software developer with a strong background in C#, .NET Core, and web development. Passionate about creating seamless and intuitive user experiences.",
        "jobPreferences": "Seeking challenging roles in web development where I can utilize my skills in C# and .NET Core to contribute to the creation of modern and user-friendly applications."
      },
      {
        "skills": "Ruby on Rails, PostgreSQL",
        "workExperience": "Full Stack Developer at Airbnb. Contributed to the development of the Airbnb platform, focusing on building and maintaining features using Ruby on Rails and PostgreSQL. Worked closely with product managers to deliver user-centric solutions.",
        "education": "Bachelor's degree in Computer Science from Stanford University. Completed coursework in web development and database systems.",
        "curriculumVitae": "https://example.com/resume5",
        "backgroundColor": "#ff69b4",
        "textColor": "#333333",
        "fontFamily": "Courier New",
        "profilePicture": "/images/candidates/p5.jpg",
        "coverPicture": "https://example.com/cover_picture5",
        "coverLetter": "Passionate and creative full-stack developer with a strong background in Ruby on Rails. Committed to delivering high-quality code and creating exceptional user experiences.",
        "jobPreferences": "Looking for opportunities to contribute to innovative projects as a full-stack developer using Ruby on Rails and PostgreSQL."
      },
      {
        "skills": "Android, Kotlin, Java",
        "workExperience": "Mobile App Developer at Spotify. Developed and maintained features for the Spotify Android app using Kotlin and Java. Collaborated with designers to implement engaging and responsive mobile interfaces.",
        "education": "Master's degree in Mobile Application Development from Carnegie Mellon University. Specialized in Android app development and user interface design.",
        "curriculumVitae": "https://example.com/resume6",
        "backgroundColor": "#1db954",
        "textColor": "#ffffff",
        "fontFamily": "Roboto",
        "profilePicture": "/images/candidates/p6.jpg",
        "coverPicture": "https://example.com/cover_picture6",
        "coverLetter": "Experienced mobile app developer with a focus on Android development using Kotlin. Passionate about creating seamless and enjoyable experiences for mobile users.",
        "jobPreferences": "Seeking opportunities to contribute to the development of cutting-edge mobile applications as an Android developer."
      },
      {
        "skills": "Vue.js, Vuex, Node.js",
        "workExperience": "Frontend Developer at Netflix. Contributed to the development of the Netflix web application, specializing in Vue.js and Vuex for state management. Collaborated with UX/UI teams to implement interactive and responsive user interfaces.",
        "education": "Bachelor's degree in Computer Science from University of California, Los Angeles (UCLA). Completed coursework in web development and human-computer interaction.",
        "curriculumVitae": "https://example.com/resume7",
        "backgroundColor": "#e50914",
        "textColor": "#ffffff",
        "fontFamily": "Open Sans",
        "profilePicture": "/images/candidates/p7.jpg",
        "coverPicture": "https://example.com/cover_picture7",
        "coverLetter": "Motivated frontend developer with expertise in Vue.js and Node.js. Committed to creating visually appealing and user-friendly web applications.",
        "jobPreferences": "Seeking frontend development roles where I can utilize my skills in Vue.js and Node.js to create engaging and innovative user interfaces."
      },
      {
        "skills": "Swift, iOS Development",
        "workExperience": "iOS Developer at Apple. Contributed to the development of iOS applications, focusing on Swift programming language. Collaborated with cross-functional teams to deliver seamless and performance-driven mobile experiences.",
        "education": "Master's degree in Mobile App Development from University of Michigan. Specialized in iOS application development and mobile user experience design.",
        "curriculumVitae": "https://example.com/resume8",
        "backgroundColor": "#a6a6a6",
        "textColor": "#000000",
        "fontFamily": "Helvetica Neue",
        "profilePicture": "/images/candidates/p8.jpg",
        "coverPicture": "https://example.com/cover_picture8",
        "coverLetter": "Experienced iOS developer with a passion for creating elegant and efficient mobile applications. Excited to contribute to projects that push the boundaries of mobile technology.",
        "jobPreferences": "Seeking challenging roles in iOS development where I can apply my expertise in Swift and contribute to the success of innovative mobile applications."
      },
      {
        "skills": "Angular, TypeScript, Java",
        "workExperience": "Full Stack Developer at Microsoft Azure. Developed and maintained features for cloud-based applications using Angular, TypeScript, and Java. Collaborated with DevOps teams to ensure seamless deployment and scalability.",
        "education": "Bachelor's degree in Computer Engineering from University of Texas at Austin. Specialized in full-stack development and cloud computing.",
        "curriculumVitae": "https://example.com/resume9",
        "backgroundColor": "#b52e31",
        "textColor": "#ffffff",
        "fontFamily": "Arial",
        "profilePicture": "/images/candidates/p9.jpg",
        "coverPicture": "https://example.com/cover_picture9",
        "coverLetter": "Enthusiastic full-stack developer with expertise in Angular and Java. Dedicated to delivering high-quality software solutions for complex cloud-based applications.",
        "jobPreferences": "Seeking opportunities to contribute to the development of scalable and efficient cloud-based systems as a full-stack developer."
      },
      {
        "skills": "PHP, Laravel, MySQL",
        "workExperience": "Backend Developer at Facebook. Contributed to the development of backend services for social media platforms using PHP, Laravel, and MySQL. Collaborated with data engineering teams to optimize database performance.",
        "education": "Master's degree in Computer Science from University of Illinois at Urbana-Champaign. Specialized in web development and database management.",
        "curriculumVitae": "https://example.com/resume10",
        "backgroundColor": "#1877f2",
        "textColor": "#ffffff",
        "fontFamily": "Roboto",
        "profilePicture": "/images/candidates/p10.jpg",
        "coverPicture": "https://example.com/cover_picture10",
        "coverLetter": "Experienced backend developer with a focus on PHP and Laravel. Passionate about creating efficient and scalable backend solutions for large-scale social media platforms.",
        "jobPreferences": "Seeking challenging roles in backend development where I can apply my expertise in PHP and contribute to the success of impactful web applications."
      }
  ]
  